terraform plan
```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.assume_role will be updated in-place
  ~ resource "aws_iam_policy" "assume_role" {
        arn    = "arn:aws:iam::133032889584:policy/allow-assume-cross-account-role"
        id     = "arn:aws:iam::133032889584:policy/allow-assume-cross-account-role"
        name   = "allow-assume-cross-account-role"
        path   = "/"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                        Action   = "sts:AssumeRole"
                        Effect   = "Allow"
                      ~ Resource = [
                          + "arn:aws:iam::960119293461:role/CrossAccountAdmin",
                            "arn:aws:iam::894947205914:role/CrossAccountAdmin",
                            "arn:aws:iam::821341638715:role/CrossAccountAdmin",
                            "arn:aws:iam::810504390172:role/CrossAccountAdmin",
                            "arn:aws:iam::765358534566:role/CrossAccountAdmin",
                            "arn:aws:iam::756406097870:role/CrossAccountAdmin",
                            "arn:aws:iam::708694795332:role/CrossAccountAdmin",
                            "arn:aws:iam::699351240001:role/CrossAccountAdmin",
                            "arn:aws:iam::587807691409:role/CrossAccountAdmin",
                            "arn:aws:iam::570696747145:role/CrossAccountAdmin",
                            "arn:aws:iam::560284223511:role/CrossAccountAdmin",
                            "arn:aws:iam::559685638163:role/CrossAccountAdmin",
                            "arn:aws:iam::555546682965:role/CrossAccountAdmin",
                            "arn:aws:iam::541873662368:role/CrossAccountAdmin",
                            "arn:aws:iam::533787958253:role/CrossAccountAdmin",
                            "arn:aws:iam::461353137281:role/CrossAccountAdmin",
                            "arn:aws:iam::447901181022:role/CrossAccountAdmin",
                            "arn:aws:iam::340731855345:role/CrossAccountAdmin",
                            "arn:aws:iam::312530187933:role/CrossAccountAdmin",
                            "arn:aws:iam::217680906704:role/CrossAccountAdmin",
                            "arn:aws:iam::213305845712:role/CrossAccountAdmin",
                            "arn:aws:iam::195022191070:role/CrossAccountAdmin",
                            "arn:aws:iam::144433228153:role/CrossAccountAdmin",
                            "arn:aws:iam::138431511372:role/CrossAccountAdmin",
                            "arn:aws:iam::133032889584:role/CrossAccountAdmin",
                            "arn:aws:iam::096224847349:role/CrossAccountAdmin",
                            "arn:aws:iam::034795980528:role/CrossAccountAdmin",
                            "arn:aws:iam::025697984663:role/CrossAccountAdmin",
                            "arn:aws:iam::001907687576:role/CrossAccountAdmin",
                        ]
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # local_file.aws_config will be created
  + resource "local_file" "aws_config" {
      + content              = <<~EOT
            [default]
            region = us-east-1
            
            [profile tts-cloudgov-sandbox]
            role_arn = arn:aws:iam::559685638163:role/CrossAccountAdmin
            source_profile = default
            
            [profile tts-cloudgov-jump]
            role_arn = arn:aws:iam::756406097870:role/CrossAccountAdmin
            source_profile = default
            
            [profile fpt202-gsa-tts-payer]
            role_arn = arn:aws:iam::810504390172:role/CrossAccountAdmin
            source_profile = default
            
            [profile api-data-gov]
            role_arn = arn:aws:iam::195022191070:role/CrossAccountAdmin
            source_profile = default
            
            [profile federalist]
            role_arn = arn:aws:iam::960119293461:role/CrossAccountAdmin
            source_profile = default
            
            [profile tts-datagov-ssb]
            role_arn = arn:aws:iam::821341638715:role/CrossAccountAdmin
            source_profile = default
            
            [profile 18f-infrastructure]
            role_arn = arn:aws:iam::570696747145:role/CrossAccountAdmin
            source_profile = default
            
            [profile search-gov]
            role_arn = arn:aws:iam::213305845712:role/CrossAccountAdmin
            source_profile = default
            
            [profile 18f-enterprise]
            role_arn = arn:aws:iam::144433228153:role/CrossAccountAdmin
            source_profile = default
            
            [profile identity-secopsprod]
            role_arn = arn:aws:iam::217680906704:role/CrossAccountAdmin
            source_profile = default
            
            [profile identity-prod]
            role_arn = arn:aws:iam::555546682965:role/CrossAccountAdmin
            source_profile = default
            
            [profile identity-analytics-prod]
            role_arn = arn:aws:iam::461353137281:role/CrossAccountAdmin
            source_profile = default
            
            [profile data-gov]
            role_arn = arn:aws:iam::587807691409:role/CrossAccountAdmin
            source_profile = default
            
            [profile coe-innovation-lab]
            role_arn = arn:aws:iam::533787958253:role/CrossAccountAdmin
            source_profile = default
            
            [profile identity-secopsdev]
            role_arn = arn:aws:iam::138431511372:role/CrossAccountAdmin
            source_profile = default
            
            [profile cloud-gov-dev2]
            role_arn = arn:aws:iam::096224847349:role/CrossAccountAdmin
            source_profile = default
            
            [profile tts-cloudgov-federalist]
            role_arn = arn:aws:iam::312530187933:role/CrossAccountAdmin
            source_profile = default
            
            [profile tts-faas-dev]
            role_arn = arn:aws:iam::447901181022:role/CrossAccountAdmin
            source_profile = default
            
            [profile tts-faas-prod]
            role_arn = arn:aws:iam::708694795332:role/CrossAccountAdmin
            source_profile = default
            
            [profile identity-sandbox]
            role_arn = arn:aws:iam::894947205914:role/CrossAccountAdmin
            source_profile = default
            
            [profile cloud-gov-dev]
            role_arn = arn:aws:iam::560284223511:role/CrossAccountAdmin
            source_profile = default
            
            [profile aws-gsa-18f-prod]
            role_arn = arn:aws:iam::133032889584:role/CrossAccountAdmin
            source_profile = default
            
            [profile aws-gsa-18f-cloud-gov]
            role_arn = arn:aws:iam::699351240001:role/CrossAccountAdmin
            source_profile = default
            
            [profile tts-faas-test]
            role_arn = arn:aws:iam::025697984663:role/CrossAccountAdmin
            source_profile = default
            
            [profile gsa]
            role_arn = arn:aws:iam::765358534566:role/CrossAccountAdmin
            source_profile = default
            
            [profile aws-gsa-18f-sandbox]
            role_arn = arn:aws:iam::001907687576:role/CrossAccountAdmin
            source_profile = default
            
            [profile identity-master]
            role_arn = arn:aws:iam::340731855345:role/CrossAccountAdmin
            source_profile = default
            
            [profile identity-interviews]
            role_arn = arn:aws:iam::034795980528:role/CrossAccountAdmin
            source_profile = default
            
            [profile pif]
            role_arn = arn:aws:iam::541873662368:role/CrossAccountAdmin
            source_profile = default
        EOT
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./aws_config.ini"
      + id                   = (known after apply)
    }

  # module.cloud_gov_jump_setup.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::756406097870:role/SecurityAudit"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudcustodian"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.cloud_gov_jump_setup.aws_iam_role_policy_attachment.cloudcustodian will be created
  + resource "aws_iam_role_policy_attachment" "cloudcustodian" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
      + role       = "cloudcustodian"
    }

  # module.cloud_gov_sandbox_setup.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::559685638163:role/SecurityAudit"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudcustodian"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.cloud_gov_sandbox_setup.aws_iam_role_policy_attachment.cloudcustodian will be created
  + resource "aws_iam_role_policy_attachment" "cloudcustodian" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
      + role       = "cloudcustodian"
    }

  # module.data_gov_ssb_setup.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::821341638715:role/SecurityAudit"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudcustodian"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.data_gov_ssb_setup.aws_iam_role_policy_attachment.cloudcustodian will be created
  + resource "aws_iam_role_policy_attachment" "cloudcustodian" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
      + role       = "cloudcustodian"
    }

  # module.federalist_setup.aws_iam_group.admins will be created
  + resource "aws_iam_group" "admins" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Administrators"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.federalist_setup.aws_iam_group.securityaudit_group will be created
  + resource "aws_iam_group" "securityaudit_group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "securityaudit"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.federalist_setup.aws_iam_group_policy_attachment.admin will be created
  + resource "aws_iam_group_policy_attachment" "admin" {
      + group      = "Administrators"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

  # module.federalist_setup.aws_iam_group_policy_attachment.securityaudit will be created
  + resource "aws_iam_group_policy_attachment" "securityaudit" {
      + group      = "securityaudit"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
    }

  # module.federalist_setup.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::960119293461:role/SecurityAudit"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudcustodian"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.federalist_setup.aws_iam_role_policy_attachment.cloudcustodian will be created
  + resource "aws_iam_role_policy_attachment" "cloudcustodian" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
      + role       = "cloudcustodian"
    }

  # module.tts_faas_dev_setup.aws_iam_group.admins will be created
  + resource "aws_iam_group" "admins" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Administrators"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.tts_faas_dev_setup.aws_iam_group.securityaudit_group will be created
  + resource "aws_iam_group" "securityaudit_group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "securityaudit"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.tts_faas_dev_setup.aws_iam_group_policy_attachment.admin will be created
  + resource "aws_iam_group_policy_attachment" "admin" {
      + group      = "Administrators"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

  # module.tts_faas_dev_setup.aws_iam_group_policy_attachment.securityaudit will be created
  + resource "aws_iam_group_policy_attachment" "securityaudit" {
      + group      = "securityaudit"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
    }

  # module.tts_faas_dev_setup.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::447901181022:role/SecurityAudit"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudcustodian"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.tts_faas_dev_setup.aws_iam_role_policy_attachment.cloudcustodian will be created
  + resource "aws_iam_role_policy_attachment" "cloudcustodian" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
      + role       = "cloudcustodian"
    }

  # module.tts_faas_prod_setup.aws_iam_group.admins will be created
  + resource "aws_iam_group" "admins" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Administrators"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.tts_faas_prod_setup.aws_iam_group.securityaudit_group will be created
  + resource "aws_iam_group" "securityaudit_group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "securityaudit"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.tts_faas_prod_setup.aws_iam_group_policy_attachment.admin will be created
  + resource "aws_iam_group_policy_attachment" "admin" {
      + group      = "Administrators"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

  # module.tts_faas_prod_setup.aws_iam_group_policy_attachment.securityaudit will be created
  + resource "aws_iam_group_policy_attachment" "securityaudit" {
      + group      = "securityaudit"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
    }

  # module.tts_faas_prod_setup.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::708694795332:role/SecurityAudit"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudcustodian"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.tts_faas_prod_setup.aws_iam_role_policy_attachment.cloudcustodian will be created
  + resource "aws_iam_role_policy_attachment" "cloudcustodian" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
      + role       = "cloudcustodian"
    }

  # module.tts_faas_test_setup.aws_iam_group.admins will be created
  + resource "aws_iam_group" "admins" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Administrators"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.tts_faas_test_setup.aws_iam_group.securityaudit_group will be created
  + resource "aws_iam_group" "securityaudit_group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "securityaudit"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.tts_faas_test_setup.aws_iam_group_policy_attachment.admin will be created
  + resource "aws_iam_group_policy_attachment" "admin" {
      + group      = "Administrators"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

  # module.tts_faas_test_setup.aws_iam_group_policy_attachment.securityaudit will be created
  + resource "aws_iam_group_policy_attachment" "securityaudit" {
      + group      = "securityaudit"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
    }

  # module.tts_faas_test_setup.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::025697984663:role/SecurityAudit"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudcustodian"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.tts_faas_test_setup.aws_iam_role_policy_attachment.cloudcustodian will be created
  + resource "aws_iam_role_policy_attachment" "cloudcustodian" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
      + role       = "cloudcustodian"
    }

Plan: 31 to add, 1 to change, 0 to destroy.
```